akamud.vscode-theme-onelight
arcticicestudio.nord-visual-studio-code
asvetliakov.vscode-neovim
bradlc.vscode-tailwindcss
chouzz.vscode-better-align
cschlosser.doxdocgen
dbaeumer.vscode-eslint
dnicolson.binary-plist
dotjoshjohnson.xml
enkia.tokyo-night
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
github.copilot-chat
github.github-vscode-theme
golang.go
humao.rest-client
jeff-hykin.better-cpp-syntax
jscearcy.rust-doc-viewer
juanblanco.solidity
koihik.vscode-lua-format
liviuschera.noctis
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-python.debugpy
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.live-server
ms-vscode.makefile-tools
redhat.vscode-commons
redhat.vscode-yaml
robbowen.synthwave-vscode
sumneko.lua
tamasfe.even-better-toml
teabyii.ayu
unifiedjs.vscode-mdx
vincentfiestada.cold-horizon-vscode
vscodevim.vim
vue.volar
