1yib.rust-bundle
ajshortt.tokyo-hack
akamud.vscode-theme-onelight
arcticicestudio.nord-visual-studio-code
asvetliakov.vscode-neovim
bigous.vscode-multi-line-tricks
bradlc.vscode-tailwindcss
ccimage.jsonviewer
chouzz.vscode-better-align
continue.continue
cschlosser.doxdocgen
csstools.postcss
dbaeumer.vscode-eslint
developer2006.svg-gallery
dnicolson.binary-plist
dotjoshjohnson.xml
dtsvet.vscode-wasm
dustypomerleau.rust-syntax
dutchigor.json-viewer
eamodio.gitlens
enkia.tokyo-night
esbenp.prettier-vscode
fdidron.theme-panictheme
firefox-devtools.vscode-firefox-debug
gio00.convertplist
github.copilot-chat
github.github-vscode-theme
golang.go
gottfired.css2react
gregorbiswanger.json2ts
humao.rest-client
jasonnutter.search-node-modules
jeff-hykin.better-cpp-syntax
johnpapa.vscode-peacock
jscearcy.rust-doc-viewer
juanblanco.solidity
junv.recent-files
koihik.vscode-lua-format
liviuschera.noctis
markthomasmiller.sorcerer
mechatroner.rainbow-csv
mrmlnc.vscode-postcss-sorting
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
nathhorrigan.code-svgr
octref.vetur
orta.vscode-jest
raathigeshan.waypoint
redhat.vscode-commons
redhat.vscode-yaml
robbowen.synthwave-vscode
rust-lang.rust-analyzer
securisec.github-actions
serayuzgur.crates
simonsiefke.svg-preview
sirtobi.pegjs-language
solarliner.linux-themes
stuart.unique-window-colors
sumneko.lua
tamasfe.even-better-toml
teabyii.ayu
tinkertrain.theme-panda
unifiedjs.vscode-mdx
vexp.vexp-vscode
vincentfiestada.cold-horizon-vscode
vscodevim.vim
vue.volar
will-stone.plastic
wix.vscode-import-cost
yummygum.city-lights-icon-vsc
yummygum.city-lights-theme
yzhang.markdown-all-in-one
