tap "anomalyco/tap"
tap "arthur-ficial/tap"
tap "bellicose100xp/tap"
tap "dart-lang/dart"
tap "dopplerhq/cli"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "sptim/formulae"
tap "steipete/tap"
tap "universal-ctags/universal-ctags"
brew "aom"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "batt", restart_service: :changed
brew "biome"
brew "boost"
brew "freetype"
brew "fontconfig"
brew "glib"
brew "coreutils"
brew "docker", link: false
brew "docutils"
# brew "folly"
#brew "fasd"
brew "fizz"
brew "wangle"
brew "edencommon"
brew "eza"
brew "fd"
brew "findutils"
brew "fluid-synth"
brew "font-util"
brew "fzf"
brew "jpeg-xl"
brew "libavif"
brew "gdk-pixbuf"
brew "node"
brew "gemini-cli"
brew "git"
brew "gnu-sed"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "lua"
brew "highlight"
brew "htop"
brew "jnv"
brew "jq"
brew "jqp"
brew "kubernetes-cli"
brew "lazygit"
brew "libslirp"
brew "libssh"
brew "luajit"
brew "luv"
brew "mas"
brew "mdf2iso"
brew "mkvtoolnix"
brew "moreutils"
brew "mvfst"
brew "neovim"
brew "node"
# brew "node-build"
# brew "nodenv"
# brew "pipenv"
# brew "pyenv"
brew "qemu"
brew "qt"
brew "rename"
brew "ripgrep"
brew "sdl2"
brew "sdl2_image"
# brew "sdl2_mixer"
brew "sdl2_ttf"
brew "subversion"
brew "tcl-tk"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags", args: ["HEAD"]
brew "uv"
brew "virtualenv"
brew "watchman"
brew "weasyprint"
brew "wget"
brew "wireguard-tools"
brew "xcbeautify"
brew "xcode-build-server"
brew "yarn"
brew "youtube-dl"
brew "zig"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "arthur-ficial/tap/apfel"
brew "bellicose100xp/tap/jiq"
brew "dart-lang/dart/dart"
brew "dopplerhq/cli/doppler", link: false
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "nikitabobko/tap/aerospace", args: { appdir: "/Applications" }
cask "alacritty", args: { appdir: "/Applications" }
cask "appcleaner", args: { appdir: "/Applications" }
cask "betterzip", args: { appdir: "/Applications" }
cask "coconutbattery"
cask "discord", args: { appdir: "/Applications" }
cask "font-hack", args: { appdir: "/Applications" }
cask "font-inconsolata", args: { appdir: "/Applications" }
cask "font-input", args: { appdir: "/Applications" }
cask "font-jetbrains-mono-nerd-font", args: { appdir: "/Applications" }
cask "font-mononoki", args: { appdir: "/Applications" }
cask "font-open-sans", args: { appdir: "/Applications" }
cask "font-roboto", args: { appdir: "/Applications" }
cask "hammerspoon", args: { appdir: "/Applications" }
cask "jordanbaird-ice", args: { appdir: "/Applications" }
cask "kap", args: { appdir: "/Applications" }
cask "keyboard-cleaner", args: { appdir: "/Applications" }
cask "monitorcontrol", args: { appdir: "/Applications" }
cask "moonlight", args: { appdir: "/Applications" }
cask "mos", args: { appdir: "/Applications" }
cask "pop-app", args: { appdir: "/Applications" }
cask "qlimagesize", args: { appdir: "/Applications" }
cask "qlmarkdown", args: { appdir: "/Applications" }
cask "qlprettypatch", args: { appdir: "/Applications" }
cask "qlstephen", args: { appdir: "/Applications" }
cask "quicklook-csv", args: { appdir: "/Applications" }
cask "quicklook-json", args: { appdir: "/Applications" }
cask "quicklook-video", args: { appdir: "/Applications" }
cask "quicklookase", args: { appdir: "/Applications" }
cask "redream", args: { appdir: "/Applications" }
cask "responsively", args: { appdir: "/Applications" }
cask "shifty", args: { appdir: "/Applications" }
cask "skype", args: { appdir: "/Applications" }
cask "suspicious-package", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "webpquicklook", args: { appdir: "/Applications" }
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Agenda", id: 1287445660
mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "CrystalFetch", id: 6454431289
mas "Day One", id: 1055511498
mas "ForkLift", id: 412448059
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Keynote", id: 361285480
mas "Kindle Classic", id: 405399194
mas "LG Screen Manager", id: 1142051783
mas "LottieFilesApp", id: 1531085233
mas "Lungo", id: 1263070803
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "NextDNS", id: 1464122853
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "Pages", id: 361309726
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Pixelmator", id: 407963104
mas "Save to Raindrop.io", id: 1549370672
mas "Slack", id: 803453959
mas "Steam Link", id: 1246969117
mas "Surfshark", id: 1437809329
mas "Swift Playground", id: 1496833156
mas "Tailscale", id: 1475387142
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Ulysses", id: 1225570693
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "1yib.rust-bundle"
vscode "actboy168.extension-path"
vscode "ajshortt.tokyo-hack"
vscode "akamud.vscode-theme-onelight"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "bigous.vscode-multi-line-tricks"
vscode "bradlc.vscode-tailwindcss"
vscode "ccimage.jsonviewer"
vscode "chouzz.vscode-better-align"
vscode "continue.continue"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "developer2006.svg-gallery"
vscode "dnicolson.binary-plist"
vscode "dotjoshjohnson.xml"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "dutchigor.json-viewer"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fdidron.theme-panictheme"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "gio00.convertplist"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "gottfired.css2react"
vscode "gregorbiswanger.json2ts"
vscode "humao.rest-client"
vscode "jasonnutter.search-node-modules"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "jscearcy.rust-doc-viewer"
vscode "juanblanco.solidity"
vscode "junv.recent-files"
vscode "koihik.vscode-lua-format"
vscode "liviuschera.noctis"
vscode "markthomasmiller.sorcerer"
vscode "mechatroner.rainbow-csv"
vscode "mrmlnc.vscode-postcss-sorting"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "nathhorrigan.code-svgr"
vscode "octref.vetur"
vscode "orta.vscode-jest"
vscode "raathigeshan.waypoint"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "securisec.github-actions"
vscode "simonsiefke.svg-preview"
vscode "sirtobi.pegjs-language"
vscode "solarliner.linux-themes"
vscode "stuart.unique-window-colors"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tinkertrain.theme-panda"
vscode "unifiedjs.vscode-mdx"
vscode "vexp.vexp-vscode"
vscode "vincentfiestada.cold-horizon-vscode"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "will-stone.plastic"
vscode "wix.vscode-import-cost"
vscode "yummygum.city-lights-icon-vsc"
vscode "yummygum.city-lights-theme"
vscode "yzhang.markdown-all-in-one"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/codegangsta/gin"
go "golang.org/x/tools/cmd/goimports"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "github.com/mgechev/revive"
