tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "sptim/formulae"
tap "universal-ctags/universal-ctags"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "freetype"
brew "fontconfig"
brew "glib"
brew "coreutils"
brew "docker", link: false
brew "python"
brew "docutils"
brew "folly"
#brew "fasd"
brew "fizz"
brew "tmux"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "findutils"
brew "fzf"
brew "gdk-pixbuf"
brew "git"
brew "guile"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "go"
brew "tcl-tk"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "lua"
brew "highlight"
brew "htop"
brew "jq"
brew "libslirp"
brew "libssh"
brew "luajit"
brew "luv"
brew "mas"
brew "mdf2iso"
brew "qt"
brew "mkvtoolnix"
brew "moreutils"
brew "neovim"
brew "node"
brew "node-build"
brew "nodenv"
brew "pipenv"
brew "pyenv"
brew "qemu"
brew "rename"
brew "ripgrep"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "subversion"
brew "trash"
brew "tree"
brew "watchman"
brew "wget"
brew "wireguard-tools"
brew "yarn"
brew "youtube-dl"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "dart-lang/dart/dart"
#brew "sptim/formulae/pdfbooklet"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "alacritty", args: { appdir: "/Applications" }
cask "appcleaner", args: { appdir: "/Applications" }
cask "betterzip", args: { appdir: "/Applications" }
cask "coconutbattery"
cask "discord", args: { appdir: "/Applications" }
#cask "epubquicklook", args: { appdir: "/Applications" }
#cask "figma", args: { appdir: "/Applications" }
#cask "firefox", args: { appdir: "/Applications" }
#cask "flux", args: { appdir: "/Applications" }
cask "font-hack", args: { appdir: "/Applications" }
cask "font-inconsolata", args: { appdir: "/Applications" }
cask "font-input", args: { appdir: "/Applications" }
cask "font-jetbrains-mono-nerd-font", args: { appdir: "/Applications" }
cask "font-mononoki", args: { appdir: "/Applications" }
cask "font-open-sans", args: { appdir: "/Applications" }
cask "font-roboto", args: { appdir: "/Applications" }
cask "hammerspoon", args: { appdir: "/Applications" }
#cask "iterm2-beta", args: { appdir: "/Applications" }
#cask "jdownloader", args: { appdir: "/Applications" }
cask "kap", args: { appdir: "/Applications" }
cask "keyboard-cleaner", args: { appdir: "/Applications" }
cask "monitorcontrol", args: { appdir: "/Applications" }
cask "moonlight", args: { appdir: "/Applications" }
cask "mos", args: { appdir: "/Applications" }
cask "pop", args: { appdir: "/Applications" }
cask "qlimagesize", args: { appdir: "/Applications" }
cask "qlmarkdown", args: { appdir: "/Applications" }
cask "qlprettypatch", args: { appdir: "/Applications" }
cask "qlstephen", args: { appdir: "/Applications" }
cask "qlvideo", args: { appdir: "/Applications" }
cask "quicklook-csv", args: { appdir: "/Applications" }
cask "quicklook-json", args: { appdir: "/Applications" }
cask "quicklookase", args: { appdir: "/Applications" }
cask "redream", args: { appdir: "/Applications" }
cask "responsively", args: { appdir: "/Applications" }
cask "shifty", args: { appdir: "/Applications" }
cask "skype", args: { appdir: "/Applications" }
cask "suspicious-package", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "webpquicklook", args: { appdir: "/Applications" }
#cask "xbar", args: { appdir: "/Applications" }
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Agenda", id: 1287445660
mas "Amphetamine", id: 937984704
mas "Day One", id: 1055511498
mas "Disk Speed Test", id: 425264550
mas "ForkLift", id: 412448059
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LottieFiles", id: 1531085233
mas "Lungo", id: 1263070803
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Playgrounds", id: 1496833156
mas "Slack", id: 803453959
mas "Steam Link", id: 1246969117
mas "Surfshark", id: 1437809329
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Ulysses", id: 1225570693
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
