tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sptim/formulae"
tap "universal-ctags/universal-ctags"
tap "heroku/brew"
# tap "jason0x43/homebrew-neovim-nightly"

cask_args appdir: "/Applications"

# Install SVN for google fonts
brew "svn"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Mac App Store command-line interface
brew "mas"
# Tool to convert MDF (Alcohol 120% images) images to ISO images
brew "mdf2iso"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Platform built on V8 to build network applications
brew "node"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
# Python dependency management tool
brew "pipenv"
# Python version management
brew "pyenv"
# Emulator for x86 and PowerPC
brew "qemu"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# neovim
brew "neovim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# command-line utility to reorder pages in a PDF for booklet printing
brew "sptim/formulae/pdfbooklet"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Blackhole Virtual Audio Driver
brew "blackhole-2ch"

## CASKS
#cask "background-music"
cask "monitorcontrol"
cask "alacritty"
cask "appcleaner"
cask "betterzip"
cask "coconutbattery"
cask "epubquicklook"
cask "firefox"
cask "flux"
cask "font-hack"
cask "font-inconsolata"
cask "font-mononoki"
cask "font-open-sans"
cask "font-roboto"
cask "font-jetbrains-mono"
cask "font-input"
cask "hammerspoon"
cask "iterm2-beta"
cask "java"
cask "jdownloader"
cask "kap"
cask "keyboard-cleaner"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "shifty"
cask "skype"
cask "suspicious-package"
cask "vlc"
cask "webpquicklook"
#cask "bitbar"
# cask "neovim-nightly"
## browser that shows a bunch of responsive containers
cask "responsively"
## use this to invert the razer mouse scroll direction https://github.com/Caldis/Mos
cask "mos"
## Discord
cask "discord"
## Pop (remote pair programming) - used to be called Screen
cask "pop"
## Figma
cask "figma"
## Moonlight - stream windows pc and games with nvidia graphics card
cask "moonlight"
## redream - dreamcast emulator
cask "redream"



## APP STORE
mas "1Password 7", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "Affinity Publisher", id: 881418622
mas "Amphetamine", id: 937984704
mas "Day One", id: 1055511498
mas "Disk Speed Test", id: 425264550
mas "ForkLift", id: 412448059
mas "GoodNotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Steam Link", id: 1246969117
mas "Surfshark", id: 1437809329
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Ulysses", id: 1225570693
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
mas "LottieFiles", id: 1531085233
