1yib.rust-bundle
a5hk.paper
actboy168.extension-path
ajshortt.tokyo-hack
akamud.vscode-theme-onelight
alefragnani.separators
alexdauenhauer.catppuccin-noctis
alexdauenhauer.catppuccin-noctis-icons
anthonyattard.zoomer
anysphere.cursorpyright
anysphere.remote-ssh
arcticicestudio.nord-visual-studio-code
asvetliakov.vscode-neovim
atomicconcepts.atomicviz
beardedbear.beardedtheme
bigous.vscode-multi-line-tricks
biomejs.biome
bradlc.vscode-tailwindcss
buenon.scratchpads
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
ccimage.jsonviewer
charliermarsh.ruff
chouzz.vscode-better-align
codeviz.codeviz
cotion-theme-v2.cotion-theme
cschlosser.doxdocgen
csstools.postcss
dbaeumer.vscode-eslint
developer2006.svg-gallery
dnicolson.binary-plist
dotjoshjohnson.xml
dracula-theme.theme-dracula
dtsvet.vscode-wasm
dustypomerleau.rust-syntax
dutchigor.json-viewer
eamodio.gitlens
eliostruyf.vscode-hide-comments
enkia.tokyo-night
esbenp.prettier-vscode
fdidron.theme-panictheme
firefox-devtools.vscode-firefox-debug
ginfuru.ginfuru-better-solarized-dark-theme
gio00.convertplist
github.github-vscode-theme
golang.go
gottfired.css2react
gregorbiswanger.json2ts
highagency.pencildev
humao.rest-client
jasonnutter.search-node-modules
jdinhlife.gruvbox
jeff-hykin.better-cpp-syntax
johnpapa.vscode-peacock
jscearcy.rust-doc-viewer
juanblanco.solidity
junv.recent-files
koihik.vscode-lua-format
kylinideteam.gitlens
liviuschera.noctis
markthomasmiller.sorcerer
mechatroner.rainbow-csv
mrmlnc.vscode-postcss-sorting
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-python.debugpy
ms-python.isort
ms-python.mypy-type-checker
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
nathhorrigan.code-svgr
octref.vetur
orta.vscode-jest
oxc.oxc-vscode
prantlf.fold-on-open
pucelle.vscode-css-navigation
raathigeshan.waypoint
redhat.vscode-commons
redhat.vscode-yaml
robbowen.synthwave-vscode
rust-lang.rust-analyzer
saoudrizwan.claude-dev
securisec.github-actions
simonsiefke.svg-preview
sirtobi.pegjs-language
skrewbar.pastel-pink-theme
sldobri.bunker
solarliner.linux-themes
stuart.unique-window-colors
sumneko.lua
tamasfe.even-better-toml
teabyii.ayu
tinkertrain.theme-panda
tomoki1207.pdf
twxs.cmake
unifiedjs.vscode-mdx
viijay-kr.react-ts-css
vincentfiestada.cold-horizon-vscode
vscodevim.vim
vue.volar
will-stone.plastic
wix.vscode-import-cost
yummygum.city-lights-icon-vsc
yummygum.city-lights-theme
yzhang.markdown-all-in-one
