a5hk.paper
akamud.vscode-theme-onelight
alefragnani.separators
alexdauenhauer.catppuccin-noctis
alexdauenhauer.catppuccin-noctis-icons
anthonyattard.zoomer
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
anysphere.remote-wsl
arcticicestudio.nord-visual-studio-code
asvetliakov.vscode-neovim
beardedbear.beardedtheme
biomejs.biome
bradlc.vscode-tailwindcss
buenon.scratchpads
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
chouzz.vscode-better-align
cotion-theme-v2.cotion-theme
cschlosser.doxdocgen
dbaeumer.vscode-eslint
dnicolson.binary-plist
dotjoshjohnson.xml
dracula-theme.theme-dracula
eliostruyf.vscode-hide-comments
enkia.tokyo-night
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
ginfuru.ginfuru-better-solarized-dark-theme
github.github-vscode-theme
golang.go
haberdashpi.master-key
humao.rest-client
ibrahim317.cursor-chat-transfer
jdinhlife.gruvbox
jeff-hykin.better-cpp-syntax
jscearcy.rust-doc-viewer
juanblanco.solidity
koihik.vscode-lua-format
kylinideteam.gitlens
liviuschera.noctis
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-python.debugpy
ms-python.isort
ms-python.mypy-type-checker
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
prantlf.fold-on-open
pucelle.vscode-css-navigation
redhat.vscode-commons
redhat.vscode-yaml
robbowen.synthwave-vscode
skrewbar.pastel-pink-theme
sldobri.bunker
sumneko.lua
tamasfe.even-better-toml
teabyii.ayu
tomoki1207.pdf
twxs.cmake
unifiedjs.vscode-mdx
viijay-kr.react-ts-css
vincentfiestada.cold-horizon-vscode
vscodevim.vim
vue.volar
